#pragma once

#include <cstdint>

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x598
// Has VTable
// 
// MNetworkVarNames "bool m_bIsPlayingBack"
// MNetworkVarNames "bool m_bPaused"
// MNetworkVarNames "bool m_bMultiplayer"
// MNetworkVarNames "bool m_bAutogenerated"
// MNetworkVarNames "float32 m_flForceClientTime"
// MNetworkVarNames "uint16 m_nSceneStringIndex"
// MNetworkVarNames "CHandle< C_BaseFlex > m_hActorList"
class C_SceneEntity : public C_PointEntity
{
private:
	[[maybe_unused]] uint8_t __pad0538[0x8]; // 0x538
public:
	// MNetworkEnable
	bool m_bIsPlayingBack; // 0x540	
	// MNetworkEnable
	bool m_bPaused; // 0x541	
	// MNetworkEnable
	bool m_bMultiplayer; // 0x542	
	// MNetworkEnable
	bool m_bAutogenerated; // 0x543	
	// MNetworkEnable
	// MNetworkChangeCallback "OnResetClientTime"
	float m_flForceClientTime; // 0x544	
	// MNetworkEnable
	// MNetworkPriority "32"
	uint16_t m_nSceneStringIndex; // 0x548	
	bool m_bClientOnly; // 0x54a	
private:
	[[maybe_unused]] uint8_t __pad054b[0x1]; // 0x54b
public:
	CHandle< C_BaseFlex > m_hOwner; // 0x54c	
	// MNetworkEnable
	// MNetworkPriority "32"
	C_NetworkUtlVectorBase< CHandle< C_BaseFlex > > m_hActorList; // 0x550	
	bool m_bWasPlaying; // 0x568	
private:
	[[maybe_unused]] uint8_t __pad0569[0xf]; // 0x569
public:
	CUtlVector< C_SceneEntity::QueuedEvents_t > m_QueuedEvents; // 0x578	
	float m_flCurrentTime; // 0x590	
};

