#pragma once

#include <cstdint>

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x5c8
// Has VTable
// 
// MNetworkVarNames "bool m_bIsPlayingBack"
// MNetworkVarNames "bool m_bPaused"
// MNetworkVarNames "bool m_bMultiplayer"
// MNetworkVarNames "bool m_bAutogenerated"
// MNetworkVarNames "float32 m_flForceClientTime"
// MNetworkVarNames "uint16 m_nSceneStringIndex"
// MNetworkVarNames "CHandle< C_BaseFlex > m_hActorList"
class C_SceneEntity : public C_PointEntity
{
private:
	[[maybe_unused]] uint8_t __pad0568[0x8]; // 0x568
public:
	// MNetworkEnable
	bool m_bIsPlayingBack; // 0x570	
	// MNetworkEnable
	bool m_bPaused; // 0x571	
	// MNetworkEnable
	bool m_bMultiplayer; // 0x572	
	// MNetworkEnable
	bool m_bAutogenerated; // 0x573	
	// MNetworkEnable
	// MNetworkChangeCallback "OnResetClientTime"
	float m_flForceClientTime; // 0x574	
	// MNetworkEnable
	// MNetworkPriority "32"
	uint16_t m_nSceneStringIndex; // 0x578	
	bool m_bClientOnly; // 0x57a	
private:
	[[maybe_unused]] uint8_t __pad057b[0x1]; // 0x57b
public:
	CHandle< C_BaseFlex > m_hOwner; // 0x57c	
	// MNetworkEnable
	// MNetworkPriority "32"
	C_NetworkUtlVectorBase< CHandle< C_BaseFlex > > m_hActorList; // 0x580	
	bool m_bWasPlaying; // 0x598	
private:
	[[maybe_unused]] uint8_t __pad0599[0xf]; // 0x599
public:
	CUtlVector< C_SceneEntity::QueuedEvents_t > m_QueuedEvents; // 0x5a8	
	float m_flCurrentTime; // 0x5c0	
};

