#pragma once

#include <cstdint>

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x500
// Has VTable
class CMapInfo : public CPointEntity
{
public:
	int32_t m_iBuyingStatus; // 0x4e0	
	float m_flBombRadius; // 0x4e4	
	int32_t m_iPetPopulation; // 0x4e8	
	bool m_bUseNormalSpawnsForDM; // 0x4ec	
	bool m_bDisableAutoGeneratedDMSpawns; // 0x4ed	
private:
	[[maybe_unused]] uint8_t __pad04ee[0x2]; // 0x4ee
public:
	float m_flBotMaxVisionDistance; // 0x4f0	
	int32_t m_iHostageCount; // 0x4f4	
	bool m_bFadePlayerVisibilityFarZ; // 0x4f8	
	
	// Datamap fields:
	// int32_t InputFireWinCondition; // 0x0
};

