#pragma once

#include <cstdint>

// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0x4e0
// Has VTable
class CMapInfo : public CPointEntity
{
public:
	int32_t m_iBuyingStatus; // 0x4c0	
	float m_flBombRadius; // 0x4c4	
	int32_t m_iPetPopulation; // 0x4c8	
	bool m_bUseNormalSpawnsForDM; // 0x4cc	
	bool m_bDisableAutoGeneratedDMSpawns; // 0x4cd	
private:
	[[maybe_unused]] uint8_t __pad04ce[0x2]; // 0x4ce
public:
	float m_flBotMaxVisionDistance; // 0x4d0	
	int32_t m_iHostageCount; // 0x4d4	
	bool m_bFadePlayerVisibilityFarZ; // 0x4d8	
	
	// Datamap fields:
	// int32_t InputFireWinCondition; // 0x0
};

