#pragma once

#include <cstdint>

struct CEntityIOOutput;
// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0xa20
// Has VTable
// 
// MNetworkVarNames "bool m_bIsPlayingBack"
// MNetworkVarNames "bool m_bPaused"
// MNetworkVarNames "bool m_bMultiplayer"
// MNetworkVarNames "bool m_bAutogenerated"
// MNetworkVarNames "float32 m_flForceClientTime"
// MNetworkVarNames "CHandle< CBaseFlex > m_hActorList"
// MNetworkVarNames "uint16 m_nSceneStringIndex"
class CSceneEntity : public CPointEntity
{
private:
	[[maybe_unused]] uint8_t __pad04c0[0x8]; // 0x4c0
public:
	CUtlSymbolLarge m_iszSceneFile; // 0x4c8	
	CUtlSymbolLarge m_iszResumeSceneFile; // 0x4d0	
	CUtlSymbolLarge m_iszTarget1; // 0x4d8	
	CUtlSymbolLarge m_iszTarget2; // 0x4e0	
	CUtlSymbolLarge m_iszTarget3; // 0x4e8	
	CUtlSymbolLarge m_iszTarget4; // 0x4f0	
	CUtlSymbolLarge m_iszTarget5; // 0x4f8	
	CUtlSymbolLarge m_iszTarget6; // 0x500	
	CUtlSymbolLarge m_iszTarget7; // 0x508	
	CUtlSymbolLarge m_iszTarget8; // 0x510	
	CHandle< CBaseEntity > m_hTarget1; // 0x518	
	CHandle< CBaseEntity > m_hTarget2; // 0x51c	
	CHandle< CBaseEntity > m_hTarget3; // 0x520	
	CHandle< CBaseEntity > m_hTarget4; // 0x524	
	CHandle< CBaseEntity > m_hTarget5; // 0x528	
	CHandle< CBaseEntity > m_hTarget6; // 0x52c	
	CHandle< CBaseEntity > m_hTarget7; // 0x530	
	CHandle< CBaseEntity > m_hTarget8; // 0x534	
	CUtlSymbolLarge m_sTargetAttachment; // 0x538	
	// MNetworkEnable
	bool m_bIsPlayingBack; // 0x540	
	// MNetworkEnable
	bool m_bPaused; // 0x541	
	// MNetworkEnable
	bool m_bMultiplayer; // 0x542	
	// MNetworkEnable
	bool m_bAutogenerated; // 0x543	
	// MNetworkEnable
	float m_flForceClientTime; // 0x544	
	float m_flCurrentTime; // 0x548	
	float m_flFrameTime; // 0x54c	
	bool m_bCancelAtNextInterrupt; // 0x550	
private:
	[[maybe_unused]] uint8_t __pad0551[0x3]; // 0x551
public:
	float m_fPitch; // 0x554	
	bool m_bAutomated; // 0x558	
private:
	[[maybe_unused]] uint8_t __pad0559[0x3]; // 0x559
public:
	int32_t m_nAutomatedAction; // 0x55c	
	float m_flAutomationDelay; // 0x560	
	float m_flAutomationTime; // 0x564	
	CHandle< CBaseEntity > m_hWaitingForThisResumeScene; // 0x568	
	bool m_bWaitingForResumeScene; // 0x56c	
	bool m_bPausedViaInput; // 0x56d	
	bool m_bPauseAtNextInterrupt; // 0x56e	
	bool m_bWaitingForActor; // 0x56f	
	bool m_bWaitingForInterrupt; // 0x570	
	bool m_bInterruptedActorsScenes; // 0x571	
	bool m_bBreakOnNonIdle; // 0x572	
	bool m_bSceneFinished; // 0x573	
private:
	[[maybe_unused]] uint8_t __pad0574[0x4]; // 0x574
public:
	// MNetworkEnable
	CNetworkUtlVectorBase< CHandle< CBaseFlex > > m_hActorList; // 0x578	
	CUtlVector< CHandle< CBaseEntity > > m_hRemoveActorList; // 0x590	
private:
	[[maybe_unused]] uint8_t __pad05a8[0x30]; // 0x5a8
public:
	int32_t m_nSceneFlushCounter; // 0x5d8	
	// MNetworkEnable
	uint16_t m_nSceneStringIndex; // 0x5dc	
private:
	[[maybe_unused]] uint8_t __pad05de[0x2]; // 0x5de
public:
	CEntityIOOutput m_OnStart; // 0x5e0	
	CEntityIOOutput m_OnCompletion; // 0x608	
	CEntityIOOutput m_OnCanceled; // 0x630	
	CEntityIOOutput m_OnPaused; // 0x658	
	CEntityIOOutput m_OnResumed; // 0x680	
	CEntityIOOutput m_OnTrigger[16]; // 0x6a8	
private:
	[[maybe_unused]] uint8_t __pad0928[0x90]; // 0x928
public:
	CHandle< CSceneEntity > m_hInterruptScene; // 0x9b8	
	int32_t m_nInterruptCount; // 0x9bc	
	bool m_bSceneMissing; // 0x9c0	
	bool m_bInterrupted; // 0x9c1	
	bool m_bCompletedEarly; // 0x9c2	
	bool m_bInterruptSceneFinished; // 0x9c3	
	bool m_bRestoring; // 0x9c4	
private:
	[[maybe_unused]] uint8_t __pad09c5[0x3]; // 0x9c5
public:
	CUtlVector< CHandle< CSceneEntity > > m_hNotifySceneCompletion; // 0x9c8	
	CUtlVector< CHandle< CSceneListManager > > m_hListManagers; // 0x9e0	
	CUtlSymbolLarge m_iszSoundName; // 0x9f8	
	CUtlSymbolLarge m_iszSequenceName; // 0xa00	
	CHandle< CBaseFlex > m_hActor; // 0xa08	
	CHandle< CBaseEntity > m_hActivator; // 0xa0c	
	int32_t m_BusyActor; // 0xa10	
	SceneOnPlayerDeath_t m_iPlayerDeathBehavior; // 0xa14	
	
	// Static fields:
	static int32_t &Get_s_nSceneFlushCounter(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CSceneEntity")->m_static_fields[0]->m_instance);};
	
	// Datamap fields:
	// void m_pScene; // 0x5d0
	// void m_pRecipientFilter; // 0xa18
	// void InputStartPlayback; // 0x0
	// void InputPausePlayback; // 0x0
	// void InputResumePlayback; // 0x0
	// void InputCancelPlayback; // 0x0
	// void InputCancelAtNextInterrupt; // 0x0
	// float InputPitchShiftPlayback; // 0x0
	// CUtlSymbolLarge InputInterjectResponse; // 0x0
	// void InputStopWaitingForActor; // 0x0
	// int32_t InputTriggerEvent; // 0x0
	// CUtlSymbolLarge InputSetTarget1; // 0x0
	// CUtlSymbolLarge InputSetTarget2; // 0x0
	// void InputScriptPlayerDeath; // 0x0
	// void InputPauseAtNextInterrupt; // 0x0
	// void m_OnTrigger[ 0 ]; // 0x6a8
	// void m_OnTrigger[ 1 ]; // 0x6d0
	// void m_OnTrigger[ 2 ]; // 0x6f8
	// void m_OnTrigger[ 3 ]; // 0x720
	// void m_OnTrigger[ 4 ]; // 0x748
	// void m_OnTrigger[ 5 ]; // 0x770
	// void m_OnTrigger[ 6 ]; // 0x798
	// void m_OnTrigger[ 7 ]; // 0x7c0
	// void m_OnTrigger[ 8 ]; // 0x7e8
	// void m_OnTrigger[ 9 ]; // 0x810
	// void m_OnTrigger[ 10 ]; // 0x838
	// void m_OnTrigger[ 11 ]; // 0x860
	// void m_OnTrigger[ 12 ]; // 0x888
	// void m_OnTrigger[ 13 ]; // 0x8b0
	// void m_OnTrigger[ 14 ]; // 0x8d8
	// void m_OnTrigger[ 15 ]; // 0x900
};

