#pragma once

#include <cstdint>

struct CEntityIOOutput;
// Registered binary: server.dll (project 'server')
// Alignment: 8
// Size: 0xa40
// Has VTable
// 
// MNetworkVarNames "bool m_bIsPlayingBack"
// MNetworkVarNames "bool m_bPaused"
// MNetworkVarNames "bool m_bMultiplayer"
// MNetworkVarNames "bool m_bAutogenerated"
// MNetworkVarNames "float32 m_flForceClientTime"
// MNetworkVarNames "CHandle< CBaseFlex > m_hActorList"
// MNetworkVarNames "uint16 m_nSceneStringIndex"
class CSceneEntity : public CPointEntity
{
private:
	[[maybe_unused]] uint8_t __pad04e0[0x8]; // 0x4e0
public:
	CUtlSymbolLarge m_iszSceneFile; // 0x4e8	
	CUtlSymbolLarge m_iszResumeSceneFile; // 0x4f0	
	CUtlSymbolLarge m_iszTarget1; // 0x4f8	
	CUtlSymbolLarge m_iszTarget2; // 0x500	
	CUtlSymbolLarge m_iszTarget3; // 0x508	
	CUtlSymbolLarge m_iszTarget4; // 0x510	
	CUtlSymbolLarge m_iszTarget5; // 0x518	
	CUtlSymbolLarge m_iszTarget6; // 0x520	
	CUtlSymbolLarge m_iszTarget7; // 0x528	
	CUtlSymbolLarge m_iszTarget8; // 0x530	
	CHandle< CBaseEntity > m_hTarget1; // 0x538	
	CHandle< CBaseEntity > m_hTarget2; // 0x53c	
	CHandle< CBaseEntity > m_hTarget3; // 0x540	
	CHandle< CBaseEntity > m_hTarget4; // 0x544	
	CHandle< CBaseEntity > m_hTarget5; // 0x548	
	CHandle< CBaseEntity > m_hTarget6; // 0x54c	
	CHandle< CBaseEntity > m_hTarget7; // 0x550	
	CHandle< CBaseEntity > m_hTarget8; // 0x554	
	CUtlSymbolLarge m_sTargetAttachment; // 0x558	
	// MNetworkEnable
	bool m_bIsPlayingBack; // 0x560	
	// MNetworkEnable
	bool m_bPaused; // 0x561	
	// MNetworkEnable
	bool m_bMultiplayer; // 0x562	
	// MNetworkEnable
	bool m_bAutogenerated; // 0x563	
	// MNetworkEnable
	float m_flForceClientTime; // 0x564	
	float m_flCurrentTime; // 0x568	
	float m_flFrameTime; // 0x56c	
	bool m_bCancelAtNextInterrupt; // 0x570	
private:
	[[maybe_unused]] uint8_t __pad0571[0x3]; // 0x571
public:
	float m_fPitch; // 0x574	
	bool m_bAutomated; // 0x578	
private:
	[[maybe_unused]] uint8_t __pad0579[0x3]; // 0x579
public:
	int32_t m_nAutomatedAction; // 0x57c	
	float m_flAutomationDelay; // 0x580	
	float m_flAutomationTime; // 0x584	
	CHandle< CBaseEntity > m_hWaitingForThisResumeScene; // 0x588	
	bool m_bWaitingForResumeScene; // 0x58c	
	bool m_bPausedViaInput; // 0x58d	
	bool m_bPauseAtNextInterrupt; // 0x58e	
	bool m_bWaitingForActor; // 0x58f	
	bool m_bWaitingForInterrupt; // 0x590	
	bool m_bInterruptedActorsScenes; // 0x591	
	bool m_bBreakOnNonIdle; // 0x592	
	bool m_bSceneFinished; // 0x593	
private:
	[[maybe_unused]] uint8_t __pad0594[0x4]; // 0x594
public:
	// MNetworkEnable
	CNetworkUtlVectorBase< CHandle< CBaseFlex > > m_hActorList; // 0x598	
	CUtlVector< CHandle< CBaseEntity > > m_hRemoveActorList; // 0x5b0	
private:
	[[maybe_unused]] uint8_t __pad05c8[0x30]; // 0x5c8
public:
	int32_t m_nSceneFlushCounter; // 0x5f8	
	// MNetworkEnable
	uint16_t m_nSceneStringIndex; // 0x5fc	
private:
	[[maybe_unused]] uint8_t __pad05fe[0x2]; // 0x5fe
public:
	CEntityIOOutput m_OnStart; // 0x600	
	CEntityIOOutput m_OnCompletion; // 0x628	
	CEntityIOOutput m_OnCanceled; // 0x650	
	CEntityIOOutput m_OnPaused; // 0x678	
	CEntityIOOutput m_OnResumed; // 0x6a0	
	CEntityIOOutput m_OnTrigger[16]; // 0x6c8	
private:
	[[maybe_unused]] uint8_t __pad0948[0x90]; // 0x948
public:
	CHandle< CSceneEntity > m_hInterruptScene; // 0x9d8	
	int32_t m_nInterruptCount; // 0x9dc	
	bool m_bSceneMissing; // 0x9e0	
	bool m_bInterrupted; // 0x9e1	
	bool m_bCompletedEarly; // 0x9e2	
	bool m_bInterruptSceneFinished; // 0x9e3	
	bool m_bRestoring; // 0x9e4	
private:
	[[maybe_unused]] uint8_t __pad09e5[0x3]; // 0x9e5
public:
	CUtlVector< CHandle< CSceneEntity > > m_hNotifySceneCompletion; // 0x9e8	
	CUtlVector< CHandle< CSceneListManager > > m_hListManagers; // 0xa00	
	CUtlSymbolLarge m_iszSoundName; // 0xa18	
	CUtlSymbolLarge m_iszSequenceName; // 0xa20	
	CHandle< CBaseFlex > m_hActor; // 0xa28	
	CHandle< CBaseEntity > m_hActivator; // 0xa2c	
	int32_t m_BusyActor; // 0xa30	
	SceneOnPlayerDeath_t m_iPlayerDeathBehavior; // 0xa34	
	
	// Static fields:
	static int32_t &Get_s_nSceneFlushCounter(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("server.dll")->FindDeclaredClass("CSceneEntity")->m_static_fields[0]->m_instance);};
	
	// Datamap fields:
	// void m_pScene; // 0x5f0
	// void m_pRecipientFilter; // 0xa38
	// void InputStartPlayback; // 0x0
	// void InputPausePlayback; // 0x0
	// void InputResumePlayback; // 0x0
	// void InputCancelPlayback; // 0x0
	// void InputCancelAtNextInterrupt; // 0x0
	// float InputPitchShiftPlayback; // 0x0
	// CUtlSymbolLarge InputInterjectResponse; // 0x0
	// void InputStopWaitingForActor; // 0x0
	// int32_t InputTriggerEvent; // 0x0
	// CUtlSymbolLarge InputSetTarget1; // 0x0
	// CUtlSymbolLarge InputSetTarget2; // 0x0
	// void InputScriptPlayerDeath; // 0x0
	// void InputPauseAtNextInterrupt; // 0x0
	// void m_OnTrigger[ 0 ]; // 0x6c8
	// void m_OnTrigger[ 1 ]; // 0x6f0
	// void m_OnTrigger[ 2 ]; // 0x718
	// void m_OnTrigger[ 3 ]; // 0x740
	// void m_OnTrigger[ 4 ]; // 0x768
	// void m_OnTrigger[ 5 ]; // 0x790
	// void m_OnTrigger[ 6 ]; // 0x7b8
	// void m_OnTrigger[ 7 ]; // 0x7e0
	// void m_OnTrigger[ 8 ]; // 0x808
	// void m_OnTrigger[ 9 ]; // 0x830
	// void m_OnTrigger[ 10 ]; // 0x858
	// void m_OnTrigger[ 11 ]; // 0x880
	// void m_OnTrigger[ 12 ]; // 0x8a8
	// void m_OnTrigger[ 13 ]; // 0x8d0
	// void m_OnTrigger[ 14 ]; // 0x8f8
	// void m_OnTrigger[ 15 ]; // 0x920
};

