#pragma once

#include <cstdint>

// Registered binary: resourcecompiler.dll (project 'resourcecompiler')
// Alignment: 8
// Size: 0x80
// Has VTable
// 
// MGetKV3ClassDefaults
class CHueSaturationColorCorrectionLayer : public CColorCorrectionLayer
{
public:
	int32_t m_nHueMaster; // 0x28	
	int32_t m_nHueRed; // 0x2c	
	int32_t m_nHueYellow; // 0x30	
	int32_t m_nHueGreen; // 0x34	
	int32_t m_nHueCyan; // 0x38	
	int32_t m_nHueBlue; // 0x3c	
	int32_t m_nHueMagenta; // 0x40	
	int32_t m_nSaturationMaster; // 0x44	
	int32_t m_nSaturationRed; // 0x48	
	int32_t m_nSaturationYellow; // 0x4c	
	int32_t m_nSaturationGreen; // 0x50	
	int32_t m_nSaturationCyan; // 0x54	
	int32_t m_nSaturationBlue; // 0x58	
	int32_t m_nSaturationMagenta; // 0x5c	
	int32_t m_nBrightnessMaster; // 0x60	
	int32_t m_nBrightnessRed; // 0x64	
	int32_t m_nBrightnessYellow; // 0x68	
	int32_t m_nBrightnessGreen; // 0x6c	
	int32_t m_nBrightnessCyan; // 0x70	
	int32_t m_nBrightnessBlue; // 0x74	
	int32_t m_nBrightnessMagenta; // 0x78	
};

