#pragma once

#include <cstdint>

// Registered binary: resourcecompiler.dll (project 'sounddoc_lib')
// Alignment: 8
// Size: 0x40
// Has VTable
// 
// MGetKV3ClassDefaults
// MPropertyFriendlyName "VMix Blend VSnds to Impulse Response Node"
// MPropertyDescription "Blends up to 8 vsnds to an impulse response."
class CMixBlendVsndsToImpulseResponse : public CMixPropertyBase
{
public:
	// MPropertyFriendlyName "Weight:0"
	float m_flWeight0; // 0x20	
	// MPropertyFriendlyName "Weight:1"
	float m_flWeight1; // 0x24	
	// MPropertyFriendlyName "Weight:2"
	float m_flWeight2; // 0x28	
	// MPropertyFriendlyName "Weight:3"
	float m_flWeight3; // 0x2c	
	// MPropertyFriendlyName "Weight:4"
	float m_flWeight4; // 0x30	
	// MPropertyFriendlyName "Weight:5"
	float m_flWeight5; // 0x34	
	// MPropertyFriendlyName "Weight:6"
	float m_flWeight6; // 0x38	
	// MPropertyFriendlyName "Weight:7"
	float m_flWeight7; // 0x3c	
};

