#pragma once

#include <cstdint>

// Registered binary: resourcecompiler.dll (project 'sounddoc_lib')
// Alignment: 8
// Size: 0x60
// Has VTable
// 
// MGetKV3ClassDefaults
// MPropertyFriendlyName "VMix Blend VSnds to Impulse Response Node"
// MPropertyDescription "Blends up to 8 vsnds to an impulse response."
class CMixBlendVsndsToImpulseResponse : public CMixPropertyBase
{
public:
	// MPropertyFriendlyName "Weight:0"
	float m_flWeight0; // 0x20	
	// MPropertyFriendlyName "Weight:1"
	float m_flWeight1; // 0x24	
	// MPropertyFriendlyName "Weight:2"
	float m_flWeight2; // 0x28	
	// MPropertyFriendlyName "Weight:3"
	float m_flWeight3; // 0x2c	
	// MPropertyFriendlyName "Weight:4"
	float m_flWeight4; // 0x30	
	// MPropertyFriendlyName "Weight:5"
	float m_flWeight5; // 0x34	
	// MPropertyFriendlyName "Weight:6"
	float m_flWeight6; // 0x38	
	// MPropertyFriendlyName "Weight:7"
	float m_flWeight7; // 0x3c	
	// MPropertyFriendlyName "PreDelayMS:0"
	float m_flPreDelayMS0; // 0x40	
	// MPropertyFriendlyName "PreDelayMS:1"
	float m_flPreDelayMS1; // 0x44	
	// MPropertyFriendlyName "PreDelayMS:2"
	float m_flPreDelayMS2; // 0x48	
	// MPropertyFriendlyName "PreDelayMS:3"
	float m_flPreDelayMS3; // 0x4c	
	// MPropertyFriendlyName "PreDelayMS:4"
	float m_flPreDelayMS4; // 0x50	
	// MPropertyFriendlyName "PreDelayMS:5"
	float m_flPreDelayMS5; // 0x54	
	// MPropertyFriendlyName "PreDelayMS:6"
	float m_flPreDelayMS6; // 0x58	
	// MPropertyFriendlyName "PreDelayMS:7"
	float m_flPreDelayMS7; // 0x5c	
};

